app/Models/NewsModel.php

SELECT *
FROM `news`
---
    public function getNews($description = false)
    {
        if ($description === false) {
            return $this->findAll();